socialNetwork/rebuttal_results/one_phone/sn_1phone_r1500.out
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 7.663ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 7.549ms, rate sampling interval: 24ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.81ms    4.20ms  22.46ms   87.90%
    Req/Sec   766.36    221.61     1.35k    68.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.68ms
 75.000%    8.08ms
 90.000%   11.22ms
 99.000%   22.46ms
 99.900%   43.84ms
 99.990%   67.90ms
 99.999%   70.21ms
100.000%   80.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.521     0.000000            1         1.00
       3.405     0.100000         7515         1.11
       4.003     0.200000        15034         1.25
       4.519     0.300000        22543         1.43
       5.067     0.400000        30064         1.67
       5.679     0.500000        37552         2.00
       6.031     0.550000        41332         2.22
       6.423     0.600000        45046         2.50
       6.903     0.650000        48801         2.86
       7.435     0.700000        52573         3.33
       8.079     0.750000        56329         4.00
       8.447     0.775000        58211         4.44
       8.847     0.800000        60084         5.00
       9.303     0.825000        61954         5.71
       9.831     0.850000        63827         6.67
      10.463     0.875000        65711         8.00
      10.799     0.887500        66635         8.89
      11.223     0.900000        67577        10.00
      11.703     0.912500        68508        11.43
      12.279     0.925000        69443        13.33
      12.975     0.937500        70385        16.00
      13.415     0.943750        70857        17.78
      13.887     0.950000        71322        20.00
      14.487     0.956250        71790        22.86
      15.135     0.962500        72258        26.67
      15.951     0.968750        72727        32.00
      16.479     0.971875        72964        35.56
      17.087     0.975000        73200        40.00
      17.807     0.978125        73433        45.71
      18.623     0.981250        73670        53.33
      19.647     0.984375        73901        64.00
      20.335     0.985938        74019        71.11
      21.135     0.987500        74136        80.00
      21.919     0.989062        74254        91.43
      22.879     0.990625        74372       106.67
      24.159     0.992188        74487       128.00
      25.215     0.992969        74546       142.22
      26.287     0.993750        74605       160.00
      27.551     0.994531        74663       182.86
      29.215     0.995313        74722       213.33
      30.879     0.996094        74781       256.00
      31.999     0.996484        74811       284.44
      33.183     0.996875        74839       320.00
      34.207     0.997266        74868       365.71
      36.095     0.997656        74899       426.67
      38.015     0.998047        74927       512.00
      38.943     0.998242        74942       568.89
      39.935     0.998437        74956       640.00
      41.439     0.998633        74971       731.43
      42.879     0.998828        74987       853.33
      43.999     0.999023        75002      1024.00
      44.703     0.999121        75008      1137.78
      45.599     0.999219        75015      1280.00
      46.975     0.999316        75022      1462.86
      47.999     0.999414        75030      1706.67
      49.119     0.999512        75037      2048.00
      50.591     0.999561        75042      2275.56
      52.863     0.999609        75044      2560.00
      55.167     0.999658        75048      2925.71
      55.359     0.999707        75052      3413.33
      58.015     0.999756        75055      4096.00
      58.495     0.999780        75057      4551.11
      60.639     0.999805        75059      5120.00
      63.423     0.999829        75061      5851.43
      66.943     0.999854        75064      6826.67
      66.943     0.999878        75064      8192.00
      67.903     0.999890        75067      9102.22
      67.903     0.999902        75067     10240.00
      67.903     0.999915        75067     11702.86
      68.031     0.999927        75068     13653.33
      68.863     0.999939        75069     16384.00
      68.863     0.999945        75069     18204.44
      69.183     0.999951        75070     20480.00
      69.183     0.999957        75070     23405.71
      69.247     0.999963        75071     27306.67
      69.247     0.999969        75071     32768.00
      69.247     0.999973        75071     36408.89
      70.207     0.999976        75072     40960.00
      70.207     0.999979        75072     46811.43
      70.207     0.999982        75072     54613.33
      70.207     0.999985        75072     65536.00
      70.207     0.999986        75072     72817.78
      80.063     0.999988        75073     81920.00
      80.063     1.000000        75073          inf
#[Mean    =        6.807, StdDeviation   =        4.202]
#[Max     =       80.000, Total count    =        75073]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  90049 requests in 1.00m, 18.89MB read
  Non-2xx or 3xx responses: 90049
Requests/sec:   1500.76
Transfer/sec:    322.43KB