socialNetwork/rebuttal_results/one_phone/sn_1phone_r400.out
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 5.864ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 5.630ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    21.83ms   74.72ms 463.61ms   94.87%
    Req/Sec   204.17    188.28   687.00     83.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.99ms
 75.000%    7.07ms
 90.000%   13.66ms
 99.000%  463.61ms
 99.900%  659.97ms
 99.990%  778.24ms
 99.999%  794.11ms
100.000%  794.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.858     0.000000            1         1.00
       3.387     0.100000         1995         1.11
       3.811     0.200000         3977         1.25
       4.179     0.300000         5965         1.43
       4.543     0.400000         7968         1.67
       4.987     0.500000         9945         2.00
       5.231     0.550000        10946         2.22
       5.515     0.600000        11920         2.50
       5.903     0.650000        12914         2.86
       6.415     0.700000        13911         3.33
       7.075     0.750000        14900         4.00
       7.563     0.775000        15397         4.44
       8.143     0.800000        15892         5.00
       8.799     0.825000        16390         5.71
       9.607     0.850000        16886         6.67
      10.871     0.875000        17382         8.00
      11.871     0.887500        17631         8.89
      13.663     0.900000        17878        10.00
      17.359     0.912500        18128        11.43
      26.191     0.925000        18376        13.33
      41.695     0.937500        18623        16.00
      68.479     0.943750        18747        17.78
     103.167     0.950000        18871        20.00
     134.399     0.956250        18998        22.86
     166.399     0.962500        19120        26.67
     209.279     0.968750        19245        32.00
     233.983     0.971875        19306        35.56
     265.471     0.975000        19368        40.00
     299.007     0.978125        19430        45.71
     345.087     0.981250        19492        53.33
     378.367     0.984375        19554        64.00
     395.263     0.985938        19585        71.11
     422.143     0.987500        19617        80.00
     452.863     0.989062        19648        91.43
     474.879     0.990625        19678       106.67
     495.103     0.992188        19709       128.00
     511.487     0.992969        19725       142.22
     525.823     0.993750        19740       160.00
     530.943     0.994531        19756       182.86
     539.647     0.995313        19773       213.33
     559.103     0.996094        19788       256.00
     567.295     0.996484        19795       284.44
     577.535     0.996875        19802       320.00
     582.143     0.997266        19810       365.71
     592.895     0.997656        19818       426.67
     614.399     0.998047        19826       512.00
     627.199     0.998242        19830       568.89
     634.367     0.998437        19833       640.00
     640.511     0.998633        19837       731.43
     651.775     0.998828        19841       853.33
     662.527     0.999023        19845      1024.00
     667.135     0.999121        19847      1137.78
     691.199     0.999219        19849      1280.00
     703.999     0.999316        19851      1462.86
     726.015     0.999414        19853      1706.67
     731.135     0.999512        19855      2048.00
     733.183     0.999561        19856      2275.56
     751.615     0.999609        19857      2560.00
     752.639     0.999658        19858      2925.71
     758.271     0.999707        19859      3413.33
     762.367     0.999756        19860      4096.00
     762.367     0.999780        19860      4551.11
     772.095     0.999805        19861      5120.00
     772.095     0.999829        19861      5851.43
     778.239     0.999854        19862      6826.67
     778.239     0.999878        19862      8192.00
     778.239     0.999890        19862      9102.22
     780.287     0.999902        19863     10240.00
     780.287     0.999915        19863     11702.86
     780.287     0.999927        19863     13653.33
     780.287     0.999939        19863     16384.00
     780.287     0.999945        19863     18204.44
     794.111     0.999951        19864     20480.00
     794.111     1.000000        19864          inf
#[Mean    =       21.829, StdDeviation   =       74.724]
#[Max     =      793.600, Total count    =        19864]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23868 requests in 1.00m, 5.01MB read
  Non-2xx or 3xx responses: 23868
Requests/sec:    397.79
Transfer/sec:     85.46KB