socialNetwork/rebuttal_results/one_phone/sn_1phone_r500.out
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 5.594ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 5.442ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.76ms    3.73ms  20.72ms   91.39%
    Req/Sec   257.01    135.85   625.00     67.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.75ms
 75.000%    6.40ms
 90.000%    9.04ms
 99.000%   20.72ms
 99.900%   41.34ms
 99.990%   82.56ms
 99.999%   93.50ms
100.000%   93.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.789     0.000000            1         1.00
       3.251     0.100000         2507         1.11
       3.671     0.200000         5000         1.25
       4.023     0.300000         7490         1.43
       4.363     0.400000        10003         1.67
       4.751     0.500000        12490         2.00
       4.979     0.550000        13733         2.22
       5.243     0.600000        14975         2.50
       5.543     0.650000        16225         2.86
       5.927     0.700000        17487         3.33
       6.399     0.750000        18716         4.00
       6.723     0.775000        19342         4.44
       7.063     0.800000        19964         5.00
       7.475     0.825000        20590         5.71
       7.931     0.850000        21216         6.67
       8.439     0.875000        21838         8.00
       8.703     0.887500        22148         8.89
       9.039     0.900000        22461        10.00
       9.439     0.912500        22771        11.43
       9.911     0.925000        23085        13.33
      10.407     0.937500        23396        16.00
      10.759     0.943750        23553        17.78
      11.151     0.950000        23708        20.00
      11.719     0.956250        23863        22.86
      12.319     0.962500        24019        26.67
      13.023     0.968750        24176        32.00
      13.519     0.971875        24254        35.56
      14.271     0.975000        24331        40.00
      15.007     0.978125        24409        45.71
      16.207     0.981250        24487        53.33
      17.279     0.984375        24565        64.00
      18.207     0.985938        24605        71.11
      19.119     0.987500        24643        80.00
      20.159     0.989062        24682        91.43
      21.215     0.990625        24721       106.67
      22.943     0.992188        24760       128.00
      24.255     0.992969        24779       142.22
      25.343     0.993750        24799       160.00
      26.511     0.994531        24818       182.86
      27.919     0.995313        24838       213.33
      29.663     0.996094        24857       256.00
      30.415     0.996484        24867       284.44
      31.663     0.996875        24877       320.00
      33.119     0.997266        24886       365.71
      34.591     0.997656        24897       426.67
      35.551     0.998047        24906       512.00
      36.351     0.998242        24911       568.89
      37.343     0.998437        24916       640.00
      38.495     0.998633        24920       731.43
      38.911     0.998828        24925       853.33
      41.727     0.999023        24930      1024.00
      42.847     0.999121        24933      1137.78
      43.743     0.999219        24935      1280.00
      44.351     0.999316        24937      1462.86
      46.527     0.999414        24940      1706.67
      47.135     0.999512        24942      2048.00
      47.999     0.999561        24944      2275.56
      51.935     0.999609        24945      2560.00
      55.007     0.999658        24946      2925.71
      55.295     0.999707        24947      3413.33
      63.103     0.999756        24948      4096.00
      69.439     0.999780        24949      4551.11
      77.503     0.999805        24950      5120.00
      77.503     0.999829        24950      5851.43
      82.559     0.999854        24952      6826.67
      82.559     0.999878        24952      8192.00
      82.559     0.999890        24952      9102.22
      82.559     0.999902        24952     10240.00
      82.559     0.999915        24952     11702.86
      84.223     0.999927        24953     13653.33
      84.223     0.999939        24953     16384.00
      84.223     0.999945        24953     18204.44
      84.223     0.999951        24953     20480.00
      84.223     0.999957        24953     23405.71
      93.503     0.999963        24954     27306.67
      93.503     1.000000        24954          inf
#[Mean    =        5.758, StdDeviation   =        3.735]
#[Max     =       93.440, Total count    =        24954]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29714 requests in 1.00m, 6.23MB read
  Non-2xx or 3xx responses: 29714
Requests/sec:    495.18
Transfer/sec:    106.39KB